src/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НоменклатураСегмента/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Сегмент содержит объект
//
// Параметры:
//  Сегмент	 - 	 - 
//  Объект	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СегментСодержитОбъект(Сегмент, Объект) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.Сегмент КАК Сегмент
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.Номенклатура = &ОбъектСегмента
	|	И СоставСегментов.Сегмент = &Сегмент");

	Запрос.УстановитьПараметр("Сегмент"       , Сегмент);
	Запрос.УстановитьПараметр("ОбъектСегмента", Объект);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции


#КонецОбласти
